---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures
source: html/296689ea-2e78-02be-66d2-e945e1c94408.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures

Failures about steel elements

## Syntax (C#)
```csharp
public static class SteelElementFailures
```